controllers/CountryController.php

SELECT COUNT(*) FROM `country`
SELECT * FROM `country` ORDER BY `name` LIMIT 5 OFFSET 5
---
    public function actionIndex()
    {
        $query = Country::find();

        $pagination = new Pagination([
            'defaultPageSize' => 5,
            'totalCount' => $query->count(),
        ]);

        $countries = $query->orderBy('name')
            ->offset($pagination->offset)
            ->limit($pagination->limit)
            ->all();